---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DuctFailures.FlexDuctLengthOutOfLimits
source: html/48b268da-e106-cb52-75c9-0bae2051d7df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DuctFailures.FlexDuctLengthOutOfLimits Property

The flex duct length of [Length Value] exceeds the maximum specified length of [Maximum Flex Duct Length Value]

## Syntax (C#)
```csharp
public static FailureDefinitionId FlexDuctLengthOutOfLimits { get; }
```